export const curriculum = [
  {
    subject: "බුද්ධ ධර්මය 10 ශ්‍රේණිය",
    lessons: [
      {
        name: "අභියෝග ජය ගත් සිදුහත් බෝසතාණෝ",
        topics: [
          "පංච මහා විලෝකනය",
          "ශිෂ්‍ය ජීවිතය සහ ශිල්ප ශාස්ත්‍ර හැදෑරීම",
          "යොවුන් වියේ අභියෝග සහ විවාහය",
          "රාජකීය සැප සම්පත් සහ අතෘප්තිමත් බව",
          "සතර පෙරනිමිති සහ ජීවිතයේ යථාර්ථය",
          "රාහුල කුමරුගේ උපත සහ මහා අභිනිෂ්ක්‍රමණය",
          "බෝසත් සිරිතෙන් ගත හැකි පොදු ආදර්ශ",
        ],
      },
      { name: "නමදිමු අගයමු මහ සඟරුවන", topics: [] },
      { name: "තෙරුවන ගුණ හඳුනා ගනිමු", topics: [] },
      { name: "කුසල් සිත් වැඩි දියුණු කරමු", topics: [] },
      { name: "විදසුන් වඩන්නෝ ඇති තතු දකින්නෝ", topics: [] },
      { name: "සසුන් කෙත සරු කළ, උතුමෝ ගුණැති පෙර කල", topics: [] },
    ],
  },
  {
    subject: "බුද්ධ ධර්මය 11 ශ්‍රේණිය",
    lessons: [
      {
        name: "බුදු සිරිත අනුව යමු අභියෝග ජය ගනිමු",
        topics: [
          "බුද්ධත්වය",
          "මාර බලවේග හඳුනාගැනීම සහ ශිෂ්‍ය ජීවිතය",
          "සාමාජික හා ශාසනික අභියෝග හමුවේ ක්‍රියා කළ ආකාරය",
          "පාරිසරික අර්බුද සහ කෘතගුණ සැලකීම",
          "දුෂ්කරතා හමුවේ නොසැලීම: වේරංජා වස් කාලය",
        ],
      },
      {
        name: "බුදුගුණ අනන්තය",
        topics: [
          "ගිලානෝපස්ථානය",
          "අසරණ සරණ ගුණය",
          "පුරිසදම්ම සාරථී ගුණය",
          "තාදි ගුණය",
          "ශිෂ්‍ය ජීවිතයට බුදුගුණවලින් ලැබෙන ආදර්ශ",
        ],
      },
      {
        name: "බුදුකුරු දම් පුරා - දිවිමග ගනිමු සපුරා",
        topics: [
          "පාරමිතා යනු",
          "තිස් වැදෑරුම් පාරමිතා සහ බෝධි ප්‍රභේද",
          "දස පාරමිතාවන්හි අන්තර්ගතය සහ ජාතක කථා",
          "පාරමිතා ගුණධර්ම පිරීමේ නිවැරදි ක්‍රමය",
          "පාරමිතා ගුණධර්මවලින් ශිෂ්‍ය ජීවිතයට ලැබෙන ආදර්ශ",
        ],
      },
      { name: "සමාධිගත සිතක මහිම", topics: [] },
      { name: "ආදර්ශවත් චරිත", topics: [] },
      { name: "සීලය හා භෞතික සංවර්ධනය", topics: [] },
      { name: "දියුණුවේ හා පිරිහීමේ දොරටු", topics: [] },
      { name: "බුදු දහමින් හෙළිවන සිතීමේ හා විමසීමේ නිදහස", topics: [] },
      { name: "බෞද්ධ අනන්‍යතාව සුරකිමින් සහජීවනයෙන් ක්‍රියා කරමු", topics: [] },
      {
        name: "සසර දුකත් දුකින් මිදීමත් උගන්වන බෞද්ධ හේතුඵල ධර්මය",
        topics: [],
      },
      { name: "බුදු දහම පදනම් කරගත් ජීවන දැක්මක්", topics: [] },
      { name: "පරිසර හිතකාමී වෙමු", topics: [] },
      { name: "බුදුබණ ඇසුරෙන් නිරෝගී දිවියක්", topics: [] },
      { name: "නිමල දහම රැකුණු අයුරු", topics: [] },
      {
        name: "මහින්දාගමනයෙන් ශ්‍රී ලාංකික ජන ජීවිතය ඔපවත් වූ ආකාරය",
        topics: [],
      },
      { name: "හෙළ බෞද්ධ කලාවේ අසිරිය", topics: [] },
      { name: "බුදු සමයෙන් පෝෂණය වූ සිංහල සාහිත්‍යය", topics: [] },
      { name: "දැහැමි ව උපයා දැහැමි ව වැය කරමු", topics: [] },
      { name: "පාලකයන්ට මග කියන බුදු දහම", topics: [] },
      { name: "ලොව්තුරු සුවේ පදනම සම්මා දිට්ඨියයි", topics: [] },
    ],
  },
  {
    subject: "විද්‍යාව 10 ශ්‍රේණිය",
    lessons: [],
  },
  {
    subject: "විද්‍යාව 11 ශ්‍රේණිය",
    lessons: [],
  },
  {
    subject: "බුද්ධ ධර්මය 10 ශ්‍රේණිය",
    lessons: [
      { name: "Lesson 1", topics: ["අභියෝග ජය ගත් සිදුහත් බෝසතාණෝ"] },
      { name: "Lesson 2", topics: ["නමදිමු අගයමු මහ සඟරුවන"] },
      { name: "Lesson 3", topics: ["තෙරුවන ගුණ හඳුනා ගනිමු"] },
      { name: "Lesson 4", topics: ["කුසල් සිත් වැඩි දියුණු කරමු"] },
      { name: "Lesson 5", topics: ["විදසුන් වඩන්නෝ ඇති තතු දකින්නෝ"] },
      { name: "Lesson 6", topics: ["සසුන් කෙත සරු කළ, උතුමෝ ගුණැති පෙර කල"] },
    ],
  },
];
